package b_operation;

/****************************
 * 연산자						*
 * @author PC-18			*
 * @since 2020.07.22		*
 ****************************/

public class operation_01 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

//		1. 연산자 기본
//		- 단항연산자
//			: ++, --, +, -, ~, !, (타입)
		
//		- 이항연산자
//			: 산술연산자
//			-> +, -, *, /, %, <<, >>, >>>
//			: 비교연산자
//			-> <, >, <=, >=, ==, !=, instanceof
//			: 논리연산자
//			-> &, |, ^, &&, ||
		
//		- 삼항연산자
//			: __?__:__
//		- 대입연산자
//			: =, op=
					
//		2. 연산우선순위
//		- 단항>이항>삼항>대입
//		- 산술>비교>논리>대입
		
		
	}

}
